In [1]:
import pandas as pd
import numpy as np

In [ ]:
# series and dataframe
person = {
    "first" : "Corey",
    "last" : " Schafer",
    "email" : "CoreyMSchafer@gmail.com"
}

In [ ]:
# series and dataframe
person1 = {
    "first" : ["Corey"],
    "last" : ["Schafer"],
    "email" : ["CoreyMSchafer@gmail.com"]
}

In [ ]:
# series and dataframe
people = {
    "first" : ["Corey", "Jane", "John"],
    "last" : ["Schafer", "Doe", "Doe"],
    "email" : ["CoreyMSchafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com"]
}

In [ ]:
# this code gets the email column
people["email"]

['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']

In [ ]:
# this converts the dictionary into a dataframe
data = pd.DataFrame(people)
data

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [ ]:
# accessing values from a column
data["email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [ ]:
type(data["email"])

pandas.core.series.Series

In [ ]:
# accessing values from a column
data.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [ ]:
# accessing values from multiple columns
data[["last", "email"]]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@gmail.com
2      Doe        JohnDoe@gmail.com

In [ ]:
# this shows the column names that is contained in the dataframe
data.columns

Index(['first', 'last', 'email'], dtype='object')

In [ ]:
# this shows the first row from the dataframe
data.iloc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [ ]:
# this selects multiple rows from the dataframe
data.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com

In [ ]:
# this selects multiple rows and columns from the dataframe 
data.iloc[[0, 1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [ ]:
data

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [ ]:
# this selects a row from the dataframe 
data.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [ ]:
# this selects multiple rows from the dataframe 
data.loc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com

In [ ]:
# this selects multiple rows and a column from the dataframe 
data.loc[[0,1], "email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [ ]:
# this selects multiple rows and columns from the dataframe 
data.loc[[0,1], ["email", "last"]]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@gmail.com      Doe

In [ ]:
data

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [ ]:
data["email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [ ]:
# indexes in pandas
# setting indexes in pandas
data.set_index("email")

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com         Jane      Doe
JohnDoe@gmail.com         John      Doe

In [ ]:
# this sets the email to be the indexes 
data.set_index("email", inplace = True)

In [ ]:
# the new dataset after setting the email as the index
data

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com         Jane      Doe
JohnDoe@gmail.com         John      Doe

In [ ]:
# this returns the indexes
data.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com'], dtype='object', name='email')

In [ ]:
data.loc["CoreyMSchafer@gmail.com"]

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [ ]:
# this gets the last name for the index "CoreyMSchafer@gmail.com" pointing to the first row
data.loc["CoreyMSchafer@gmail.com", "last"]

'Schafer'

In [ ]:
# this gets us the first row
data.iloc[0]

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [ ]:
# this resets the indexes 
data.reset_index(inplace = True)
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [ ]:
# filtering in pandas
# this checks the column called "last" if there is a name called "Doe" in the column
# if there is a name it will return True and if there is no name like "Doe" it will return False
data["last"] == "Doe"

0    False
1     True
2     True
Name: last, dtype: bool

In [ ]:
# this checks the column called "last" if there is a name called "Doe" in the column and then stores the result in a variable
# if there is a name it will return True and if there is no name like "Doe" it will return False
filt = (data["last"] == "Doe")

In [ ]:
# this returns a dataframe with the names that match the name "Doe"
data[filt]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [ ]:
# this returns a dataframe with the names that match the name "Doe"
data[data["last"] == "Doe"]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [ ]:
# this checks the column called "last" if there is a name called "Doe" in the column and then stores the result in a variable
# if there is a name it will return True and if there is no name like "Doe" it will return False
filt = (data["last"] == "Doe")

In [ ]:
# this returns a dataframe with the names that match the name "Doe"
data.loc[filt]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [ ]:
# this returns the email that matches the names "Doe"
data.loc[filt, "email"]

1    JaneDoe@gmail.com
2    JohnDoe@gmail.com
Name: email, dtype: object

In [ ]:
# this filters the dataframe for people who have first name as "John" and last name as "Doe"
filt_mult = (data["last"] == "Doe") & (data["first"] == "John")
data.loc[filt_mult, "email"]

2    JohnDoe@gmail.com
Name: email, dtype: object

In [ ]:
# this filters the dataframe for people who have first name as "John" or last name as "Schafer"
filt_mult1 = (data["last"] == "Schafer") | (data["first"] == "John")
data.loc[filt_mult1, "email"]

0    CoreyMSchafer@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [ ]:
# this filters the dataframe for people whose first name is not "John" and whose last name is not "Doe"
filt_mult = (data["last"] == "Doe") & (data["first"] == "John")
data.loc[~filt_mult, "email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [ ]:
# this filters the dataframe for people whose first name is not "John" or whose last name is not "Schafer"
filt_mult1 = (data["last"] == "Schafer") | (data["first"] == "John")
data.loc[~filt_mult1, "email"]

1    JaneDoe@gmail.com
Name: email, dtype: object

In [ ]:
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [ ]:
# updating data within our rows and columns
data.columns

Index(['email', 'first', 'last'], dtype='object')

In [ ]:
# this changes the casing of the column names to uppercase
data.columns = [x.upper() for x in data.columns]
data

                     EMAIL  FIRST     LAST
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [ ]:
# this changes the casing of the column names to lowercase
data.columns = [x.lower() for x in data.columns]
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [ ]:
# this will replace all the spaces(" ") in our column name with underscore(_)
data.columns = data.columns.str.replace(" ", "_")
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [ ]:
# formating some column names
# this will change the column names we want to change
data.rename(columns = {"first_name": "first", "last_name": "last"}, inplace = True)

In [ ]:
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [ ]:
# this changes the last name and the email for a row
data.loc[2, ["last", "email"]] = ["Doe", "JohnDoe@gmail.com"]
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [ ]:
# this changes the last name on the third row
data.loc[2, "last"] = "Smith"
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John    Smith

In [ ]:
# this changes the last name on the second row
data.at[2, "last"] = "Doe"
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [ ]:
# this changes the last name of the person who has the email "JohnDoe@gmail.com"
a = (data["email"] == "JohnDoe@gmail.com")
data.loc[a, "last"] = "Smith"

In [ ]:
data

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John    Smith

In [ ]:
# updating multiple rows of data
# this code changes the case of the contents in the email column to lower case
data["email"].str.lower()

0    coreymschafer@gmail.com
1          janedoe@gmail.com
2          johndoe@gmail.com
Name: email, dtype: object

In [ ]:
# this code changes the case of the contents in the email column to lower case
# NB: this is permanent
data["email"] = data["email"].str.lower()
data

                     email  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@gmail.com   Jane      Doe
2        johndoe@gmail.com   John    Smith

In [ ]:
# this code changes the case of the contents in the email column to upper case
# NB: this is permanent
data["email"] = data["email"].str.upper()
data

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Corey  Schafer
1        JANEDOE@GMAIL.COM   Jane      Doe
2        JOHNDOE@GMAIL.COM   John    Smith

In [ ]:
# this checks the length of all the contents in the email column
data["email"].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [ ]:
# this checks how many contents there is in all the columns
data.apply(len)

email    3
first    3
last     3
dtype: int64

In [ ]:
# this returns the mimimum value and the information of it from the dataset
data.apply(pd.Series.min)

email    COREYMSCHAFER@GMAIL.COM
first                      Corey
last                         Doe
dtype: object

In [ ]:
# this checks the length of all the contents in the dataset
data.applymap(len)

   email  first  last
0     23      5     7
1     17      4     3
2     17      4     5

In [ ]:
# this changes the case of all the contents in the dataset to lowercase
data.applymap(str.lower)

                     email  first     last
0  coreymschafer@gmail.com  corey  schafer
1        janedoe@gmail.com   jane      doe
2        johndoe@gmail.com   john    smith

In [ ]:
# this changes the names "Corey" and "Jane" to "Chris" and "Mary" respectively
data["first"].map({"Corey": "Chris", "Jane": "Mary"})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [ ]:
# this changes the names "Corey" and "Jane" to "Chris" and "Mary" respectively
data["first"] = data["first"].replace({"Corey": "Chris", "Jane": "Mary"})
data

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe
2        JOHNDOE@GMAIL.COM   John    Smith

In [ ]:
# adding & removing columns
# adding columns
data["first"] + " " + data["last"]

0    Chris Schafer
1         Mary Doe
2       John Smith
dtype: object

In [ ]:
# adding & removing columns
# adding columns
data["full_name"] = data["first"] + " " + data["last"]
data

                     email  first     last      full_name
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer  Chris Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe       Mary Doe
2        JOHNDOE@GMAIL.COM   John    Smith     John Smith

In [ ]:
# removing colums
# this removes the columns dropped permanently
data.drop(columns = ["first", "last"], inplace = True)

In [ ]:
data

                     email      full_name
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer
1        JANEDOE@GMAIL.COM       Mary Doe
2        JOHNDOE@GMAIL.COM     John Smith

In [ ]:
# splitting a column into two
data["full_name"].str.split(" ", expand = True)

       0        1
0  Chris  Schafer
1   Mary      Doe
2   John    Smith

In [ ]:
# splitting a column into two and naming the new columns
data[["first", "last"]] = data["full_name"].str.split(" ", expand = True)
data

                     email      full_name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM     John Smith   John    Smith

In [ ]:
# removing colums
# this removes the column(s) permantly
data.drop(columns = ["full_name"], inplace = True)

In [ ]:
# adding and removing rows
data.append({"first": "Tony"}, ignore_index = True)

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe
2        JOHNDOE@GMAIL.COM   John    Smith
3                      NaN   Tony      NaN

In [ ]:
people1 = {
    "first": ["Tony", "Steve"],
    "last": ["Statk", "Rogers"],
    "email": ["IronMan@avenge.com", "Cap@avenge.com"]
}
df2 = pd.DataFrame(people1)
df2

   first    last               email
0   Tony   Statk  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [ ]:
# this adds the contents of df2 into our data dataframe
data.append(df2, ignore_index = True, sort = False)

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe
2        JOHNDOE@GMAIL.COM   John    Smith
3       IronMan@avenge.com   Tony    Statk
4           Cap@avenge.com  Steve   Rogers

In [ ]:
# this adds the contents of df2 into our data dataframe and stores it in df2
df2 = data.append(df2, ignore_index = True, sort = False)
df2

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe
2        JOHNDOE@GMAIL.COM   John    Smith
3       IronMan@avenge.com   Tony    Statk
4           Cap@avenge.com  Steve   Rogers

In [ ]:
# removing rows
# this removes the content in row 4
df2.drop(index = 4)

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe
2        JOHNDOE@GMAIL.COM   John    Smith
3       IronMan@avenge.com   Tony    Statk

In [ ]:
# this removes the rows which had last name = Doe
df2.drop(index = df2[df2["last"] == "Doe"].index)

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
2        JOHNDOE@GMAIL.COM   John    Smith
3       IronMan@avenge.com   Tony    Statk
4           Cap@avenge.com  Steve   Rogers

In [ ]:
# this removes the rows which had last name = Doe
filt = df2["last"] == "Doe"
df2.drop(index = df2[filt].index)

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
2        JOHNDOE@GMAIL.COM   John    Smith
3       IronMan@avenge.com   Tony    Statk
4           Cap@avenge.com  Steve   Rogers

In [ ]:
data

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe
2        JOHNDOE@GMAIL.COM   John    Smith

In [ ]:
# sorting data
# this sorts the dataset by last name in ascending order
data.sort_values(by = "last")

                     email  first     last
1        JANEDOE@GMAIL.COM   Mary      Doe
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
2        JOHNDOE@GMAIL.COM   John    Smith

In [ ]:
# sorting data
# this sorts the dataset by last name in descending order
data.sort_values(by = "last", ascending = False)

                     email  first     last
2        JOHNDOE@GMAIL.COM   John    Smith
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe

In [ ]:
# sorting data
# this sorts the dataset by the column "last" first then followed by the column "first" both in descending order
data.sort_values(by = ["last", "first"], ascending = False)

                     email  first     last
2        JOHNDOE@GMAIL.COM   John    Smith
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe

In [ ]:
# sorting data
# this sorts the dataset by the column "last" in descending order first then followed by the column "first" in ascending order
data.sort_values(by = ["last", "first"], ascending = [False, True], inplace = True)
data

                     email  first     last
2        JOHNDOE@GMAIL.COM   John    Smith
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe

In [ ]:
# sort the index
# this sorts the index in ascending order
data.sort_index()

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris  Schafer
1        JANEDOE@GMAIL.COM   Mary      Doe
2        JOHNDOE@GMAIL.COM   John    Smith

In [ ]:
# this code sorts the column "last" in ascending order of alphabets
data["last"].sort_values()

1        Doe
0    Schafer
2      Smith
Name: last, dtype: object

In [11]:
# handling missing values
people = {
    "first" : ["Corey", "Jane", "John", "Chris", np.nan, None, "NA"],
    "last" : ["Schafer", "Doe", "Doe", "Schafer", np.nan, np.nan, "Missing"],
    "email" : ["CoreyMSchafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com", None, np.nan, "Ananymous@gmail.com", "NA"],
    "age" : ["33", "55", "63", "36", None, None, "Missing"]
}

df3 = pd.DataFrame(people)
df3.replace("NA", np.nan, inplace = True)
df3.replace("Missing", np.nan, inplace = True)
df3

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Ananymous@gmail.com  None
6    NaN      NaN                      NaN   NaN

In [9]:
# this code removes any row with missing data
df3.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JohnDoe@gmail.com  63

In [8]:
# this code drops the rows that have missing values through out the row
# if if had just one missing value it won't drop it 
df3.dropna(axis = "index", how = "all")

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Ananymous@gmail.com  None

In [ ]:
# this code will drop columns that have all the contents in that column as missing values
df3.dropna(axis = "columns", how = "all")

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Ananymous@gmail.com  None
6    NaN      NaN                      NaN   NaN

In [ ]:
# this code will drop columns that have at least one missing value
df3.dropna(axis = "columns", how = "any")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [7]:
# this drops only rows that dont have an email
df3.dropna(axis = "index", how = "any", subset = ["email"])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
5   None      NaN      Ananymous@gmail.com  None

In [6]:
# this drops only rows that dont have an email
df3.dropna(subset = ["email"])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
5   None      NaN      Ananymous@gmail.com  None

In [5]:
# this drops only rows that dont have an email and last name
df3.dropna(axis = "index", how = "all", subset = ["last", "email"])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Ananymous@gmail.com  None

In [ ]:
# this drops only rows that dont have an email and last name
# this makes the changes permanent
df3.dropna(axis = "index", how = "all", subset = ["last", "email"], inplace = True)

In [4]:
# 
df3.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [3]:
# this fills all the missing values with the word "MISSING"
df3.fillna("MISSING")

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@gmail.com       55
2     John      Doe        JohnDoe@gmail.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Ananymous@gmail.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [12]:
# this fills all the missing values with the number 0
df3.fillna(0)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JohnDoe@gmail.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Ananymous@gmail.com   0
6      0        0                        0   0

In [10]:
# this fills all the missing values with the number 0
# this makes the changes permanent
df3.fillna(0, inplace = True)

In [14]:
# casting datatypes
df3.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [16]:
# df3["age"] = df["age"].astype(int) -> this would work if we dont have NaN values in the column you are trying to convert
# this converts the age column to float datatype
df3["age"] = df3["age"].astype(float)

In [17]:
df3.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [18]:
# this finds the average of the ages
df3["age"].mean()

46.75

In [ ]:
# this converts the whole dataset to the selected datatype
# this is useful when all the columns are of one datatype
# df3.astype(datatype)

In [6]:
# dropping duplicate rows
import pandas as pd
import numpy as np
faith = {
    "Names": ["Raj", "Rajat", "Gaurav", "Karan", "Aasif", "Raj"],
    "Marks": [56, 89, 90, 45, 34, 56],
    "City": [ "Pune", "Bagalore", "Mumbai", "Kolkata", "Delhi", "Pune",]
}
df = pd.DataFrame(faith)
df

    Names  Marks      City
0     Raj     56      Pune
1   Rajat     89  Bagalore
2  Gaurav     90    Mumbai
3   Karan     45   Kolkata
4   Aasif     34     Delhi
5     Raj     56      Pune

In [7]:
# dropping duplicate rows
df.drop_duplicates(subset = "Names", keep = "first")

    Names  Marks      City
0     Raj     56      Pune
1   Rajat     89  Bagalore
2  Gaurav     90    Mumbai
3   Karan     45   Kolkata
4   Aasif     34     Delhi

In [8]:
# dropping duplicate rows
df.drop_duplicates(subset = "Names", keep = "last")

    Names  Marks      City
1   Rajat     89  Bagalore
2  Gaurav     90    Mumbai
3   Karan     45   Kolkata
4   Aasif     34     Delhi
5     Raj     56      Pune

In [9]:
# dropping duplicate rows
df.drop_duplicates(subset = "Names", keep = False)

    Names  Marks      City
1   Rajat     89  Bagalore
2  Gaurav     90    Mumbai
3   Karan     45   Kolkata
4   Aasif     34     Delhi

In [10]:
# dropping duplicate rows
df.drop_duplicates(subset = "Names", keep = "first", inplace = True)

In [11]:
df

    Names  Marks      City
0     Raj     56      Pune
1   Rajat     89  Bagalore
2  Gaurav     90    Mumbai
3   Karan     45   Kolkata
4   Aasif     34     Delhi

In [12]:
fedi = {
    "Names": ["Raj", "Rajat", "Gaurav", "Karan", "Aasif"],
    "Marks": [56, 89, 90, 45, 34],
    "City": ["united states", "united states", "united states", "united states", "united states"]
}
df = pd.DataFrame(fedi)
df

    Names  Marks           City
0     Raj     56  united states
1   Rajat     89  united states
2  Gaurav     90  united states
3   Karan     45  united states
4   Aasif     34  united states

In [15]:
# how to capitalize the first letter of each word in a colomn
df.City = df.City.str.title()
df.City

0    United States
1    United States
2    United States
3    United States
4    United States
Name: City, dtype: object

In [16]:
df

    Names  Marks           City
0     Raj     56  United States
1   Rajat     89  United States
2  Gaurav     90  United States
3   Karan     45  United States
4   Aasif     34  United States

In [ ]:
# how to join two datasets together